<script>
  import NaginataTextarea from '../../NaginataTextarea.svelte';
</script>

<main class="container">


  <section>
    <h4>レッスン７　拗音２、外来音</h4>
    <p>学ぶこと　りひち　ほふけつ　え　外来音</p>
    
    <p>
      拗音に使われるカナなどを、まずマスターします。
  </p>
  
  <img src="lesson7-1.png" width="400"/>
  
<pre><code>り　ひ　ち　理科　陸　なりたい　あります　倫理
近い　たち　たちが悪い　地区　知己　知識　知的
昼　開く　左　ひれ　びれる　悪びれる　悪びれない
引く　引っ張る　悲喜こもごも　悲観的
ひりひりすること

ほ　ふ　け　つ　え
</code></pre>

<NaginataTextarea autofocus/>

<p>
濁音、半濁音に関する排他的配置……「ふ」「つ」はシフトカナですが、１キーに濁音化するカナ、半濁音化するカナは１つしかなく、一意に決まるため、シフトキー不要です。
</p>

<pre><code>ぶ　ぷ　つ　づ　げ　ぼ　ぽ
いける　いけない　逃げる　投げる　けど　だけど　だけで
方法　その方が　ぽっと出　プールする　　文章　一分（いちぶ／いっぷん）
部分　分解　ぷくぷく　ぶくぶく　ぽくぽく　ぴくぴく　びくびくする　ブイブイ
使う　使わない　いつも　ついつい　ツンデレ　つづく　続ける
える　思える　考える　入れ替え　帰る　前　ぁぃぅぇぉ
</code></pre>

<NaginataTextarea/>

<p>
拗音になる第一音は、イ段カナに決まっています。
つまり、「きしちにひみり」しかありません。
これとゃゅょ、濁音、半濁音が組み合わされるだけです。
日本語のすべての拗音は以下です。
実際に打ってみましょう。
</p>

<img src="lesson7-2.png" width="400"/>

<pre><code>きゃきゅきょ　ぎゃぎゅぎょ
しゃしゅしょ　じゃじゅじょ
ちゃちゅちょ　ぢゃぢゅぢょ
にゃにゅにょ
ひゃひゅひょ　びゃびゅびょ　ぴゃぴゅぴょ
みゃみゅみょ
りゃりゅりょ
</code></pre>

<NaginataTextarea/>

<p>
ぴゃぴゅぴょは非常に押しにくい配置です。
とくにぴゃは難しい運指を要求されます（やは人差し指、゜は中指推奨）。
しかし、「ぴゃ」が出る日本語は、八百と六百しかないのでほぼ使いません。
</p>

<pre><code>象徴　強調　頂上　上長　調教　丁々発止　中小　嘲笑　着任
着々　ちゃんと　ちょっと　着色　仲介　注意　注釈
明朝　了解　留意　少量　了承　略　以下略　虜囚
評価　表紙　評判　商標　表象　日向　百人　百回
</code></pre>

<NaginataTextarea/>

<p>
「ぴゃぴゅぴょ」の半濁音拗音をとくに練習しておきましょう。
</p>

<pre><code>ぴゃぴゅぴょ　八百人　ピューマ　コンピューター　ピュア　
ピューリタン　発表　信憑　病気　病的　白夜　誤謬　何百回　
六百　三百
</code></pre>

<NaginataTextarea/>

<p>
拗音以外のカタカナ二音で表記される、ティやファなどを外来音といいます。
</p>
<p>
  【外来音同時押し】
</p>
<ul>
  <li>清音一文字目の音＋半濁音＋二文字目の音</li>
  <li>濁音一文字目の音＋濁音＋二文字目の音</li>
</ul>
<p>
外来音は常に３キー同時押しです。
使用２音までは同じですが、プラス半濁音（清音）または濁音（濁音）と、３キー目が常に必要としました。
（むかしのバージョンの薙刀式では２キー同時押しでしたが、頻度の割りに誤打が多く、３キー同時に改めました）
</p>

<img src="lesson7-3.png" width="400"/>
<p>
【左手一打＋右手二打】
</p>
<pre><code>ティ　ディ　トゥ　ドゥ
テュ　デュ　シェ　チェ　ジェ　ヂェ
ティー　パーティー　ティーパーティー　ティアドロップ
ディスる　ディレクター　ディストピア　ハンディキャップ
テイルトゥノーズ　インストゥルメント　アンドゥ　ドゥワップ
トゥドゥリスト　チェック　チェック　チェンジ　チェス
デューク　フォンデュ　プロデューサー　テュルク
シェフ　シェル　ジェット　ジェル　シェル　シェパード
ダイジェスト　　ガジェット　クリシェ
</code></pre>

<NaginataTextarea/>

<p>
  ヴァ行に関しては、「ヴ」をVという外来音だと思って、ヴ＋M＋あいえおゆで合成してください。
ヴァ行の頻度から難しくてもよいとしました。
Qとの同時押しの小書きを使う手もあります。
</p>


<pre><code>ヴァラエティ　ヴィーナス　ヴォルテージ　ヴォリューム
ヴェール　オーシャンヴュー　インタヴュー　ヴィヴァルディ
</code></pre>

<NaginataTextarea/>

<img src="lesson7-4.png" width="400"/>

<p>
【右手二打＋左手一打】
</p>

<pre><code>ウィウェウォ　イェ　ツァ
ファフィフェフォフュ
クァクィクェクォクヮ
グァグィグェグォグヮ
ウォーキング　ウォール街　ウィークポイント
ウィークエンド　ウィンドウ
ウェーブ　ウェスト　イェルサレム　イェール　イェーツ　イェーイ
</code></pre>

<NaginataTextarea/>

<pre><code>ファイル　フィクション　フィールド　フォント　フェイク
フェスティバル　ファクト　ファンタスティック　フェードアウト　
フューチャー　フュージョン
パンツァー　ツァイガルニク効果　ツァーリボンバー
クォリティ　クォーツ　クォーク　クェーサー　クィック　シークヮーサー　グァバ
</code></pre>
  
  <NaginataTextarea/>

  </section>
  
  <p>
    <a href="/lesson8">【レッスン8へ移る】</a>
  </p>
  
</main>