<script>
  import NaginataTextarea from '../../NaginataTextarea.svelte';
</script>

<main class="container">


  <section>
    <h4>レッスン６　半濁音、小書き、拗音</h4>
    <p>学ぶこと　き　み　を　よ　ゆ　や　ー　半濁音　小書き</p>
    
    <p>
    薙刀式のウリのひとつは拗音同時押しですが、その前に拗音のパーツになる一文字目（イ段カナ）と、やゆよを先にマスターします。
    </p>
  
  <img src="lesson6-1.png" width="400"/>
  
<pre><code>き　ぎ　み　を　　よ　ゆ　や　ー（長音）
効かない　効く　効く時
的な　的に　指摘　来て　とき　ときどき
見ない　見る　見る時　来てみる
余裕　猶予
</code></pre>

<NaginataTextarea autofocus/>

<pre><code>あー　うー　トーク　シート　ニート
きみ　きみがいない　きみがいる　それごとき
出来る　出来ない　出来ないことがある　出来ることから
要するに　内容　内容があることとないこと　ようやく
そのようだ　このような　悠々　ゆくゆくは
ヴ　イヴ
</code></pre>

<NaginataTextarea/>

<p>
  半濁音を学びましょう。
  逆手の人差し指下段と同時押しです。
</p>

<pre><code>は　ぱ　ば　半端　ばんばん　パンパンに　パート　バター
</code></pre>

<NaginataTextarea/>

<p>
  小書きは、Qと同時押しです。
  実際は次項の拗音同時押しを使いますが、緊急用です。
</p>

<pre><code>ゃゅょ　ぁぃぅぉ　ゎ
</code></pre>

<NaginataTextarea/>

<p>まずはこれでためしに拗音を作ってみましょう。</p>

<pre><code>しょうがない　しようがない　写真　宿題　今日
</code></pre>

<NaginataTextarea/>

<p>
なお、PQは薬指推奨です。
とくにP位置の「ゅ」は薬指で打つとやりやすいですよ。
</p>
<p>
【拗音同時押し】左手のイ段カナと、右手のやゆよ（のあるキー）と同時押しで拗音。
さらに濁音キー、半濁音キーと３キー同時押しで濁拗音、半濁拗音。
</p>

<img src="lesson6-2.png" width="400"/>

<pre><code>し　しょ　じ　じょ　しゅ　じゅ　しゃ　じゃ
き　きょ　ぎ　ぎょ　きゅ　ぎゅ　きゃ　ぎゃ　
しょう　じょう　しゅう　じゅう
きょう　ぎょう　きゅう　ぎゅう
にょ　にゅ　にゃ　みょ　みゅ　みゃ

</code></pre>

<NaginataTextarea/>

<p>
「にゃ」行、「みゃ」行では、「に」「み」はシフト側の音ですが、シフトを押しながら打つ必要はありません。
同じキーの中に拗音になる音が一つしかないので、一意に決まるからです。
これを「拗音に関して排他的配置」と呼びます。
</p>

<pre><code>ショート　シュート　シャーク　ジョーク　ジューク
キュート　ぎゃーぎゃー　しょうがない　しようがない
じゃあ、逆に
でしょう　なるでしょう　あるでしょう　ないでしょう
</code></pre>

<NaginataTextarea/>

<pre><code>写真　宿題　今日　今日から　今日からは
師匠　事象　笑止　障子　少々　上々　少女　処女　症状
上司　市場　初志　女子　所持　辞書　証書　序章　教師　司教　自供　教示　帰郷
虚偽　義侠 将棋　常軌　行事　状況　商業　漁業　漁礁
社会　弱点　尺 邪悪　客　逆　逆に
</code></pre>

<NaginataTextarea/>

<pre><code>趣旨　終始　刺繍　重視　樹脂　習字　従事　縮　塾
主観　主君　主義　手記
九　九州　九十　十九　授業　牛耳る　休職　住職　給仕　休止
牛乳　尿　収入　乳業　巨乳　入賞　女性（にょしょう）
脈　妙な　ミャンマー
</code></pre>
  
  <NaginataTextarea/>

<p>
拗音同時押しをするとき、たとえば「しる」と「しょ」、「とる」と「にょ」を打ち分けられるようにしておきましょう。
最初の音を「離してから」次を打つと「同時に押している瞬間はない」ので、打ち分けられるようになります。
</p>
    
  </section>
  
  <p>
    <a href="/lesson7">【レッスン7へ移る】</a>
  </p>
  
</main>