<script>
  import NaginataTextarea from '../../NaginataTextarea.svelte';
</script>

<main class="container">


  <section>
    <h4>レッスン４　左手周辺部とセンターシフト</h4>
    <p>学ぶこと　センターシフト　にま　れそ　おもの</p>

    <img src="lesson4.png" width="400"/>
    
    <p>
      センターシフトを学びましょう。
      スペースキーがシフトキーを兼ねています（SandS: Space and Shift。
      常に有効で、英数時に大文字や記号にすることも可能）。
      スペースキーを、「単独で押して離すとスペースキー、押しながらほかに何か押すとシフトキーになる」と設定してあります。
    </p>
    <p>
      右手でシフトしても左手でシフトしてもよいので、センターシフトといいます。
      どちらの親指でシフトしてもよいですが、「逆手でシフトする」（右手のキーを押すときは左手親指でシフト、左手のキーは右親指で）ようにすると、疲れにくくなります。
    </p>
    <p>      
      重要なことは、押しっぱなしで複数の入力に効くこと（連続シフト）です。
      濁音同時押しとは違い、「先に押して、押しっぱなしにしておく」ことが必要です。
      注意してください。
      親指の構造は他の指と違うので、慣れると無意識に使い分けられます。
      </p>
    
<pre><code>もの　ま　に　まに　も　の　もの

まにあう　ます　まにあいます　します　ますます　まずまず
まずない　まずい　うまい　ここにある　ここにない
れ　これ　それ　どれ　あれ
お　も　の　思う　もう　思うもの
のだ　なのだ　そうなのだ　　魔物　煮物　大物　ものがある
それがどうした　あれがこうなのだ　　そうだと思う
だがそうでない　それにこうだ　どれにする　なにもない
</code></pre>
  
  <NaginataTextarea autofocus/>

  <pre><code>これにそれもない　ああ言うがそうだなと思う　
そのことがこうなるなんて　あのことがそうなるなんて　
などなど　になる　男　女
まで　までに　でも　ので　でに　での
それまでに　あしたまでに　だがこうなので　儲かるので
でもそうなんだ　これでも　でもしかし
</code></pre>
      
    <NaginataTextarea/>
      
  </section>
  
  <p>
    <a href="/lesson5">【レッスン5へ移る】</a>
  </p>
  
</main>